# How do I apply a function to a pandas Series or DataFrame?

In [1]:
import pandas as pd

In [2]:
train = pd.read_csv("http://bit.ly/kaggletrain")

In [3]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
train['Sex_num'] = train.Sex.map({'female': 0, 'male': 1})

In [5]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Sex_num
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,1

In [7]:
train.loc[0:4, ['Sex', 'Sex_num']]

      Sex  Sex_num
0    male        1
1  female        0
2  female        0
3  female        0
4    male        1

In [10]:
train['Name_length'] = train['Name'].apply(len)

In [11]:
train.loc[0:4, ['Name', 'Name_length']]

                                                Name  Name_length
0                            Braund, Mr. Owen Harris           23
1  Cumings, Mrs. John Bradley (Florence Briggs Th...           51
2                             Heikkinen, Miss. Laina           22
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)           44
4                           Allen, Mr. William Henry           24

In [13]:
len("Braund, Mr. Owen Harris")

23

In [14]:
import numpy as np

In [20]:
train['Fare_ceil'] = train['Fare'].apply(np.round)

In [21]:
train.loc[0:4, ['Fare', 'Fare_ceil']]

      Fare  Fare_ceil
0   7.2500        7.0
1  71.2833       71.0
2   7.9250        8.0
3  53.1000       53.0
4   8.0500        8.0

In [26]:
train['Name'].str.split(',').head()

0                           [Braund,  Mr. Owen Harris]
1    [Cumings,  Mrs. John Bradley (Florence Briggs ...
2                            [Heikkinen,  Miss. Laina]
3      [Futrelle,  Mrs. Jacques Heath (Lily May Peel)]
4                          [Allen,  Mr. William Henry]
Name: Name, dtype: object

In [27]:
train['first_name'] = train['Name'].apply(lambda x : x.split(',')[0])

In [28]:
train.loc[0:4, ['first_name', 'Name']]

  first_name                                               Name
0     Braund                            Braund, Mr. Owen Harris
1    Cumings  Cumings, Mrs. John Bradley (Florence Briggs Th...
2  Heikkinen                             Heikkinen, Miss. Laina
3   Futrelle       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4      Allen                           Allen, Mr. William Henry

In [29]:
def get_elemnt(my_list, position) -> list and int:
    return my_list[position]

In [31]:
train['Name'].str.split(',').apply(get_elemnt, position=0).head(3)

0       Braund
1      Cumings
2    Heikkinen
Name: Name, dtype: object

In [32]:
train['Name'].str.split(',').apply(lambda x : x[0]).head(3)

0       Braund
1      Cumings
2    Heikkinen
Name: Name, dtype: object

In [33]:
drinks = pd.read_csv("http://bit.ly/drinksbycountry")

In [34]:
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

In [40]:
drinks.loc[: , 'beer_servings': 'wine_servings'].apply(max, axis=0)

beer_servings      376
spirit_servings    438
wine_servings      370
dtype: int64

In [47]:
my_list = [1, 2, 3]
print(my_list[-1])
print(my_list[-2])
print(my_list[-3])

3
2
1

In [48]:
new_list = list()
for i in range(-1, -len(my_list)-1, -1):
    new_list.append(my_list[i])
    print(i)
print(new_list)

-1
-2
-3
[3, 2, 1]

In [52]:
drinks.loc[:, 'beer_servings': 'wine_servings'] = drinks.loc[:, 'beer_servings': 'wine_servings'].applymap(float)
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa